Revit 2027 API
BuiltInFailures.AutoRouteFailures.MismatchedSystemTypeWarning Property
 The selected fixture is part of a different system. You may want to edit the system type and merge two systems.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchedSystemTypeWarning { get; }
Public Shared ReadOnly Property MismatchedSystemTypeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchedSystemTypeWarning {
	FailureDefinitionId^ get ();
}
static member MismatchedSystemTypeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace